# Description

The purpose of this work is to get acquainted with the basic methods of the Pandas library for improving the work with tabular data.

# Tasks

## Part 1. Titanic data

You can find the Titanic data at this [link](https://www.kaggle.com/c/titanic/data) (combine train and test datasets first).

In [1]:
import pandas as pd

In [2]:
titanic_data = pd.read_csv('data/titanic.csv', index_col='PassengerId')
titanic_data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Task 1. The number of men and women on the ship.

In [3]:
titanic_data['Sex'].value_counts()

male      843
female    466
Name: Sex, dtype: int64

Task 2. Count the proportion of surviving passengers.

In [4]:
round(len(titanic_data[titanic_data['Survived'] == 1.0])/len(titanic_data) * 100, 2)

26.13

Task 3. Count the proportion of first class passengers.

In [5]:
round(len(titanic_data[titanic_data['Pclass'] == 1])/len(titanic_data) * 100, 2)

24.68

Task 4. Calculate the mean and median of passengers' age.

In [6]:
print('Mean: ', titanic_data.mean()['Age'])
print('Median: ', titanic_data.median()['Age'])

Mean:  29.881137667304014
Median:  28.0

Task 5. Calculate the Pearson correlation between the SibSp and Parch columns.

In [7]:
titanic_data[['SibSp', 'Parch']].corr(method='pearson')

          SibSp     Parch
SibSp  1.000000  0.373587
Parch  0.373587  1.000000

Task 6. Find the most popular female names on the ship.

In [8]:
female_df = titanic_data[titanic_data['Sex'] == 'female']

name_list = []
for item in female_df['Name']:
    if 'Mrs' in item:
        try:
            name = item.split('(')[1].split(' ')[0].replace(')', '').replace(' ', '')
            name_list.append(name)
            
        except(IndexError):
            name = item.split('Mrs.')[1].split(' ')[1]
            name_list.append(name)
            
    elif 'Miss' in item: 
        name = item.split('Miss. ')[1].split(' ')[0]
        name_list.append(name)
        
pd.Series(name_list).value_counts()[:5]

Mary         22
Anna         16
Elizabeth    16
Margaret     11
Ellen         9
dtype: int64

## Part 2. World University Rankings

You can find the World University Rankings data at this [link](https://www.kaggle.com/mylesoneill/world-university-rankings) (cwurData.csv).

In [9]:
university_data = pd.read_csv('data/cwurData.csv')
university_data.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

Task 1. Leave only the data for 2015 in the rating.

In [10]:
university_data_2015 = university_data[university_data['year'] == 2015]
university_data_2015 = university_data_2015.reset_index().drop(columns=['index'])
university_data_2015.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,1,1,1,1,1,1,1.0,3,100.00,2015
1,2,Stanford University,USA,2,9,2,4,5,3,3,4.0,10,98.66,2015
2,3,Massachusetts Institute of Technology,USA,3,3,11,2,15,2,2,2.0,1,97.54,2015
3,4,University of Cambridge,United Kingdom,1,2,10,5,11,6,12,13.0,48,96.81,2015
4,5,University of Oxford,United Kingdom,2,7,13,10,7,12,7,9.0,15,96.46,2015

Task 2. Calculate the maximum, minimum and mean total score of the world rating.

In [11]:
print('Max score: ', university_data_2015['score'].max())
print('Min score: ', university_data_2015['score'].min())
print('Mean score: ', university_data_2015['score'].mean())

Max score:  100.0
Min score:  44.02
Mean score:  46.86385

Task 3. For all the countries mentioned, list the number of universities included in the world ranking. Organize the conclusion by decreasing the number of universities.

In [12]:
university_data_2015['country'].value_counts()

USA                     229
China                    83
Japan                    74
United Kingdom           65
Germany                  55
France                   49
Italy                    47
Spain                    40
South Korea              36
Canada                   33
Australia                27
Taiwan                   21
Brazil                   18
India                    16
Netherlands              13
Austria                  12
Sweden                   11
Belgium                  10
Turkey                   10
Poland                    9
Switzerland               9
Finland                   9
Ireland                   8
Iran                      8
Portugal                  7
Israel                    7
Greece                    7
Hong Kong                 6
Hungary                   6
New Zealand               6
Norway                    5
Russia                    5
Czech Republic            5
Denmark                   5
South Africa              5
Chile                     4
Egypt                     4
Saudi Arabia              4
Malaysia                  3
Argentina                 3
Thailand                  3
Singapore                 2
Colombia                  2
Mexico                    2
Slovenia                  2
Romania                   2
United Arab Emirates      1
Estonia                   1
Puerto Rico               1
Slovak Republic           1
Serbia                    1
Croatia                   1
Uruguay                   1
Bulgaria                  1
Iceland                   1
Uganda                    1
Lebanon                   1
Cyprus                    1
Lithuania                 1
Name: country, dtype: int64

Task 4. Calculate for each country the value that is the sum of the total scores of its universities. Organize the conclusion in descending order of this value.

In [13]:
university_data_2015.groupby(['country'])['score'].sum().sort_values(ascending=False)

country
USA                     11475.24
China                    3724.58
Japan                    3423.63
United Kingdom           3120.30
Germany                  2543.14
France                   2258.18
Italy                    2126.85
Spain                    1793.80
South Korea              1651.65
Canada                   1543.89
Australia                1236.93
Taiwan                    944.03
Brazil                    803.39
India                     712.78
Netherlands               627.10
Austria                   539.85
Sweden                    523.00
Belgium                   467.66
Switzerland               453.57
Turkey                    443.34
Finland                   409.04
Poland                    399.07
Ireland                   360.93
Israel                    358.31
Iran                      353.31
Portugal                  314.68
Greece                    313.07
Hong Kong                 276.20
New Zealand               269.55
Hungary                   266.47
Denmark                   240.27
Russia                    234.21
Norway                    232.62
South Africa              230.49
Czech Republic            223.40
Chile                     178.69
Saudi Arabia              177.17
Egypt                     176.38
Thailand                  134.76
Malaysia                  134.12
Argentina                 133.78
Singapore                 102.73
Mexico                     89.84
Slovenia                   88.98
Colombia                   88.49
Romania                    88.08
Iceland                    44.91
Estonia                    44.68
Croatia                    44.62
Lebanon                    44.38
Slovak Republic            44.38
Serbia                     44.33
Lithuania                  44.25
Bulgaria                   44.19
Uganda                     44.16
Uruguay                    44.16
Cyprus                     44.10
United Arab Emirates       44.08
Puerto Rico                44.06
Name: score, dtype: float64

Task 5. Calculate the best university for each country, organize the conclusion by this value.

In [14]:
idxs_max_score = university_data_2015.groupby(['country'])['score'].idxmax()
university_data_2015.iloc[idxs_max_score, :][['country', 'institution', 'score']].sort_values('score', ascending=False)

,country,institution,score
0,USA,Harvard University,100.00
3,United Kingdom,University of Cambridge,96.81
12,Japan,University of Tokyo,78.23
19,Switzerland,Swiss Federal Institute of Technology in Zurich,66.93
22,Israel,Hebrew University of Jerusalem,65.71
23,South Korea,Seoul National University,64.82
31,Canada,University of Toronto,60.04
35,France,École Polytechnique,59.20
55,China,Peking University,54.26
56,Taiwan,National Taiwan University,54.23
58,Russia,Lomonosov Moscow State University,54.19
64,Singapore,National University of Singapore,53.44
70,Sweden,Karolinska Institute,52.79
73,Denmark,University of Copenhagen,52.51
75,Germany,Ruprecht Karl University of Heidelberg,52.32
81,Belgium,Katholieke Universiteit Leuven,52.03
84,Netherlands,Erasmus University Rotterdam,51.78
87,Australia,University of Sydney,51.61
98,Norway,University of Oslo,50.81
110,Finland,University of Helsinki,50.04
111,Italy,Sapienza University of Rome,49.97
115,Spain,University of Barcelona,49.79
131,Brazil,University of São Paulo,49.31
148,South Africa,University of the Witwatersrand,48.75
169,Hong Kong,University of Hong Kong,48.15
184,Ireland,"Trinity College, Dublin",47.73
222,Austria,University of Vienna,47.03
256,Portugal,University of Lisbon,46.43
265,New Zealand,University of Auckland,46.38
269,Czech Republic,Charles University in Prague,46.32
300,Greece,National and Kapodistrian University of Athens,45.94
310,Thailand,Chulalongkorn University,45.86
333,Mexico,National Autonomous University of Mexico,45.58
340,India,Indian Institute of Technology Delhi,45.54
366,Argentina,University of Buenos Aires,45.37
375,Chile,Pontifical Catholic University of Chile,45.31
450,Poland,Jagiellonian University,44.94
457,Hungary,Eötvös Loránd University,44.92
460,Iceland,University of Iceland,44.91
469,Turkey,Middle East Technical University,44.87
481,Malaysia,"University of Science, Malaysia",44.84
503,Slovenia,University of Ljubljana,44.77
536,Estonia,University of Tartu,44.68
550,Croatia,University of Zagreb,44.62
568,Saudi Arabia,King Saud University,44.59
651,Colombia,University of Los Andes (Colombia),44.43
681,Lebanon,American University of Beirut,44.38
684,Slovak Republic,Comenius University in Bratislava,44.38
696,Iran,Sharif University of Technology,44.37
725,Serbia,University of Belgrade,44.33
790,Lithuania,Vilnius University,44.25
795,Egypt,Cairo University,44.25
844,Bulgaria,Sofia University,44.19
868,Uganda,Makerere University,44.16
866,Uruguay,University of the Republic (Uruguay),44.16
927,Cyprus,University of Cyprus,44.10
949,United Arab Emirates,United Arab Emirates University,44.08
961,Puerto Rico,University of Puerto Rico at Mayagüez,44.06
985,Romania,University of Bucharest,44.04

Task 6. Calculate the correlation between the patents and score columns.

In [15]:
university_data_2015['patents'].corr(university_data_2015['score'], method='pearson')

-0.45470615064887465

Task 7. Calculate the five universities with the highest rankings, display their names, overall score, countries, rankings in their country.

In [16]:
university_data_2015.sort_values('score', ascending=False)[:5][['institution', 'country', 'score', 'national_rank']]

,institution,country,score,national_rank
0,Harvard University,USA,100.00,1
1,Stanford University,USA,98.66,2
2,Massachusetts Institute of Technology,USA,97.54,3
3,University of Cambridge,United Kingdom,96.81,1
4,University of Oxford,United Kingdom,96.46,2

Task 8. Calculate the 5 universities whose graduates have the highest job ratings.

In [17]:
university_data_2015.sort_values(['alumni_employment'])[:5][['institution', 'alumni_employment']]

                   institution  alumni_employment
0           Harvard University                  1
1          Stanford University                  2
12         University of Tokyo                  3
13  University of Pennsylvania                  4
33             Keio University                  5

Task 9. Identify which of the ratings gives the largest contribution to the overall rating.

In [18]:
university_data_2015.loc[:, university_data_2015.columns != 'year'].corr()

,world_rank,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score
world_rank,1.000000,0.207617,0.577612,0.586218,0.572304,0.907588,0.876108,0.823055,0.947204,0.639701,-0.554571
national_rank,0.207617,1.000000,0.170368,0.078447,0.171665,0.303851,0.123909,0.158244,0.181568,0.104223,-0.176447
quality_of_education,0.577612,0.170368,1.000000,0.473653,0.685989,0.521378,0.549574,0.521067,0.517966,0.386652,-0.595771
alumni_employment,0.586218,0.078447,0.473653,1.000000,0.390605,0.476797,0.418218,0.449119,0.428065,0.398035,-0.480756
quality_of_faculty,0.572304,0.171665,0.685989,0.390605,1.000000,0.537166,0.570487,0.559989,0.553277,0.418088,-0.708048
publications,0.907588,0.303851,0.521378,0.476797,0.537166,1.000000,0.845110,0.788885,0.918436,0.616911,-0.521738
influence,0.876108,0.123909,0.549574,0.418218,0.570487,0.845110,1.000000,0.808917,0.913889,0.548654,-0.522732
citations,0.823055,0.158244,0.521067,0.449119,0.559989,0.788885,0.808917,1.000000,0.850637,0.518144,-0.517301
broad_impact,0.947204,0.181568,0.517966,0.428065,0.553277,0.918436,0.913889,0.850637,1.000000,0.580644,-0.527617
patents,0.639701,0.104223,0.386652,0.398035,0.418088,0.616911,0.548654,0.518144,0.580644,1.000000,-0.454706
score,-0.554571,-0.176447,-0.595771,-0.480756,-0.708048,-0.521738,-0.522732,-0.517301,-0.527617,-0.454706,1.000000